In [36]:

import pandas as pd

# Create dataframe

df1 = pd.DataFrame( {'Location': ['PUNE', 'MYS', 'HYDB', 'MYS', 'PUNE','MYS'],
         'Person': ['Ram', 'Harish', 'Anand', 'Sudha', 'Sumegha', 'Melvin'], 
         'Sales':[1200,1140,1340,1124,2143,1350]})

In [37]:
df1

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [39]:
x=df1.groupby('Location').mean()

C:\Users\ASUS\AppData\Local\Temp\ipykernel_6980\312653324.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  x=df1.groupby('Location').mean()

In [40]:
x

                Sales
Location
HYDB      1340.000000
MYS       1204.666667
PUNE      1671.500000

In [41]:
x.value_counts()

Sales
1204.666667    1
1340.000000    1
1671.500000    1
dtype: int64

In [42]:
df1.value_counts()

Location  Person   Sales
HYDB      Anand    1340     1
MYS       Harish   1140     1
          Melvin   1350     1
          Sudha    1124     1
PUNE      Ram      1200     1
          Sumegha  2143     1
dtype: int64

In [45]:
df1.tail()

  Location   Person  Sales
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143
5      MYS   Melvin   1350

In [46]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Location  6 non-null      object
 1   Person    6 non-null      object
 2   Sales     6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [47]:
df1.head()

  Location   Person  Sales
0     PUNE      Ram   1200
1      MYS   Harish   1140
2     HYDB    Anand   1340
3      MYS    Sudha   1124
4     PUNE  Sumegha   2143

In [48]:
df1.head(3)

  Location  Person  Sales
0     PUNE     Ram   1200
1      MYS  Harish   1140
2     HYDB   Anand   1340

In [51]:
df1['Location'].unique()

array(['PUNE', 'MYS', 'HYDB'], dtype=object)